In [1]:
# import all libraries

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df =pd.read_csv("Datascience.csv")

In [4]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [6]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [7]:
df = df.drop(['salary','salary_currency'],axis=1)

In [8]:
df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,CA,100,CA,M

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary_in_usd       3755 non-null   int64
 5   employee_residence  3755 non-null   object
 6   remote_ratio        3755 non-null   int64
 7   company_location    3755 non-null   object
 8   company_size        3755 non-null   object
dtypes: int64(3), object(6)
memory usage: 264.2+ KB

In [10]:
df['salary'] = df['salary_in_usd'] * 83.06

In [11]:
df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,salary
0,2023,SE,FT,Principal Data Scientist,85847,ES,100,ES,L,7130451.82
1,2023,MI,CT,ML Engineer,30000,US,100,US,S,2491800.00
2,2023,MI,CT,ML Engineer,25500,US,100,US,S,2118030.00
3,2023,SE,FT,Data Scientist,175000,CA,100,CA,M,14535500.00
4,2023,SE,FT,Data Scientist,120000,CA,100,CA,M,9967200.00

In [12]:
df = df.drop(['salary_in_usd'],axis=1)

In [13]:
df.head()

,work_year,experience_level,employment_type,job_title,employee_residence,remote_ratio,company_location,company_size,salary
0,2023,SE,FT,Principal Data Scientist,ES,100,ES,L,7130451.82
1,2023,MI,CT,ML Engineer,US,100,US,S,2491800.00
2,2023,MI,CT,ML Engineer,US,100,US,S,2118030.00
3,2023,SE,FT,Data Scientist,CA,100,CA,M,14535500.00
4,2023,SE,FT,Data Scientist,CA,100,CA,M,9967200.00

In [24]:
# Differentiate the dataset wit dependant and indepent variables

In [25]:
x = df.drop(['salary'],axis=1)

In [26]:
x.head()

,work_year,experience_level,employment_type,job_title,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,ES,100,ES,L
1,2023,MI,CT,ML Engineer,US,100,US,S
2,2023,MI,CT,ML Engineer,US,100,US,S
3,2023,SE,FT,Data Scientist,CA,100,CA,M
4,2023,SE,FT,Data Scientist,CA,100,CA,M

In [27]:
y = df[['salary']]

In [28]:
y

           salary
0      7130451.82
1      2491800.00
2      2118030.00
3     14535500.00
4      9967200.00
...           ...
3750  34220720.00
3751  12542060.00
3752   8721300.00
3753   8306000.00
3754   7862874.90

[3755 rows x 1 columns]

In [29]:
# numerical Feature

In [33]:
numerical_val = x.select_dtypes(exclude="object").columns

In [34]:
numerical_val

Index(['work_year', 'remote_ratio'], dtype='object')

In [36]:
x['work_year'].unique()

array([2023, 2022, 2020, 2021], dtype=int64)

In [37]:
x['remote_ratio'].unique()

array([100,   0,  50], dtype=int64)

In [38]:
# Categorical Feature

In [40]:
categorical_val = x.select_dtypes(include="object").columns

In [41]:
categorical_val

Index(['experience_level', 'employment_type', 'job_title',
       'employee_residence', 'company_location', 'company_size'],
      dtype='object')

In [42]:
x['experience_level'].unique()

array(['SE', 'MI', 'EN', 'EX'], dtype=object)

In [43]:
x['employment_type'].unique()

array(['FT', 'CT', 'FL', 'PT'], dtype=object)

In [45]:
x['company_location'].unique()

array(['ES', 'US', 'CA', 'DE', 'GB', 'NG', 'IN', 'HK', 'NL', 'CH', 'CF',
       'FR', 'FI', 'UA', 'IE', 'IL', 'GH', 'CO', 'SG', 'AU', 'SE', 'SI',
       'MX', 'BR', 'PT', 'RU', 'TH', 'HR', 'VN', 'EE', 'AM', 'BA', 'KE',
       'GR', 'MK', 'LV', 'RO', 'PK', 'IT', 'MA', 'PL', 'AL', 'AR', 'LT',
       'AS', 'CR', 'IR', 'BS', 'HU', 'AT', 'SK', 'CZ', 'TR', 'PR', 'DK',
       'BO', 'PH', 'BE', 'ID', 'EG', 'AE', 'LU', 'MY', 'HN', 'JP', 'DZ',
       'IQ', 'CN', 'NZ', 'CL', 'MD', 'MT'], dtype=object)